Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph048.h
extern volatile __IPC31bits_t IPC31bits __asm__ ("IPC31") __attribute__((section("sfrs"), address(0xBF810330)));
extern volatile uint32_t        IPC31CLR __attribute__((section("sfrs"),address(0xBF810334)));
extern volatile uint32_t        IPC31SET __attribute__((section("sfrs"),address(0xBF810338)));
extern volatile uint32_t        IPC31INV __attribute__((section("sfrs"),address(0xBF81033C)));
#define IPC32 IPC32
extern volatile uint32_t   IPC32 __attribute__((section("sfrs"), address(0xBF810340)));
typedef union {
  struct {
    uint32_t :16;
    uint32_t AD1D24IS:2;
    uint32_t AD1D24IP:3;
    uint32_t :3;
    uint32_t AD1D25IS:2;
    uint32_t AD1D25IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC32bits_t;
extern volatile __IPC32bits_t IPC32bits __asm__ ("IPC32") __attribute__((section("sfrs"), address(0xBF810340)));
extern volatile uint32_t        IPC32CLR __attribute__((section("sfrs"),address(0xBF810344)));
extern volatile uint32_t        IPC32SET __attribute__((section("sfrs"),address(0xBF810348)));
extern volatile uint32_t        IPC32INV __attribute__((section("sfrs"),address(0xBF81034C)));
#define IPC33 IPC33
extern volatile uint32_t   IPC33 __attribute__((section("sfrs"), address(0xBF810350)));
typedef union {
  struct {
    uint32_t AD1D26IS:2;
    uint32_t AD1D26IP:3;
    uint32_t :3;
    uint32_t AD1D27IS:2;
    uint32_t AD1D27IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC33bits_t;
extern volatile __IPC33bits_t IPC33bits __asm__ ("IPC33") __attribute__((section("sfrs"), address(0xBF810350)));
extern volatile uint32_t        IPC33CLR __attribute__((section("sfrs"),address(0xBF810354)));
extern volatile uint32_t        IPC33SET __attribute__((section("sfrs"),address(0xBF810358)));
extern volatile uint32_t        IPC33INV __attribute__((section("sfrs"),address(0xBF81035C)));
#define IPC34 IPC34
extern volatile uint32_t   IPC34 __attribute__((section("sfrs"), address(0xBF810360)));
typedef struct {
  uint32_t w:32;
} __IPC34bits_t;
extern volatile __IPC34bits_t IPC34bits __asm__ ("IPC34") __attribute__((section("sfrs"), address(0xBF810360)));
extern volatile uint32_t        IPC34CLR __attribute__((section("sfrs"),address(0xBF810364)));
extern volatile uint32_t        IPC34SET __attribute__((section("sfrs"),address(0xBF810368)));
extern volatile uint32_t        IPC34INV __attribute__((section("sfrs"),address(0xBF81036C)));
#define IPC36 IPC36
extern volatile uint32_t   IPC36 __attribute__((section("sfrs"), address(0xBF810380)));
typedef union {
  struct {
    uint32_t :16;
    uint32_t AD1D40IS:2;
    uint32_t AD1D40IP:3;
    uint32_t :3;
    uint32_t AD1D41IS:2;
    uint32_t AD1D41IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC36bits_t;
extern volatile __IPC36bits_t IPC36bits __asm__ ("IPC36") __attribute__((section("sfrs"), address(0xBF810380)));
extern volatile uint32_t        IPC36CLR __attribute__((section("sfrs"),address(0xBF810384)));
extern volatile uint32_t        IPC36SET __attribute__((section("sfrs"),address(0xBF810388)));
extern volatile uint32_t        IPC36INV __attribute__((section("sfrs"),address(0xBF81038C)));
#define IPC38 IPC38
extern volatile uint32_t   IPC38 __attribute__((section("sfrs"), address(0xBF8103A0)));
typedef union {
  struct {
    uint32_t AD1D46IS:2;
    uint32_t AD1D46IP:3;
    uint32_t :3;
    uint32_t AD1D47IS:2;
    uint32_t AD1D47IP:3;
    uint32_t :3;
    uint32_t AD1D48IS:2;
    uint32_t AD1D48IP:3;
    uint32_t :3;
    uint32_t AD1D49IS:2;
    uint32_t AD1D49IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC38bits_t;
extern volatile __IPC38bits_t IPC38bits __asm__ ("IPC38") __attribute__((section("sfrs"), address(0xBF8103A0)));
extern volatile uint32_t        IPC38CLR __attribute__((section("sfrs"),address(0xBF8103A4)));
extern volatile uint32_t        IPC38SET __attribute__((section("sfrs"),address(0xBF8103A8)));
extern volatile uint32_t        IPC38INV __attribute__((section("sfrs"),address(0xBF8103AC)));
#define IPC39 IPC39
extern volatile uint32_t   IPC39 __attribute__((section("sfrs"), address(0xBF8103B0)));
typedef union {
  struct {
    uint32_t AD1D50IS:2;
    uint32_t AD1D50IP:3;
    uint32_t :3;
    uint32_t AD1D51IS:2;
    uint32_t AD1D51IP:3;
    uint32_t :3;
    uint32_t AD1D52IS:2;
    uint32_t AD1D52IP:3;
    uint32_t :3;
    uint32_t AD1D53IS:2;
    uint32_t AD1D53IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC39bits_t;
extern volatile __IPC39bits_t IPC39bits __asm__ ("IPC39") __attribute__((section("sfrs"), address(0xBF8103B0)));
extern volatile uint32_t        IPC39CLR __attribute__((section("sfrs"),address(0xBF8103B4)));
extern volatile uint32_t        IPC39SET __attribute__((section("sfrs"),address(0xBF8103B8)));
extern volatile uint32_t        IPC39INV __attribute__((section("sfrs"),address(0xBF8103BC)));
#define IPC40 IPC40
extern volatile uint32_t   IPC40 __attribute__((section("sfrs"), address(0xBF8103C0)));
typedef union {
  struct {
    uint32_t CMP3IS:2;
    uint32_t CMP3IP:3;
    uint32_t :3;
    uint32_t CMP4IS:2;
    uint32_t CMP4IP:3;
    uint32_t :3;
    uint32_t CMP5IS:2;
    uint32_t CMP5IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC40bits_t;
extern volatile __IPC40bits_t IPC40bits __asm__ ("IPC40") __attribute__((section("sfrs"), address(0xBF8103C0)));
extern volatile uint32_t        IPC40CLR __attribute__((section("sfrs"),address(0xBF8103C4)));
extern volatile uint32_t        IPC40SET __attribute__((section("sfrs"),address(0xBF8103C8)));
extern volatile uint32_t        IPC40INV __attribute__((section("sfrs"),address(0xBF8103CC)));
#define IPC41 IPC41
extern volatile uint32_t   IPC41 __attribute__((section("sfrs"), address(0xBF8103D0)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t CAN1IS:2;
    uint32_t CAN1IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC41bits_t;
extern volatile __IPC41bits_t IPC41bits __asm__ ("IPC41") __attribute__((section("sfrs"), address(0xBF8103D0)));
extern volatile uint32_t        IPC41CLR __attribute__((section("sfrs"),address(0xBF8103D4)));
extern volatile uint32_t        IPC41SET __attribute__((section("sfrs"),address(0xBF8103D8)));
extern volatile uint32_t        IPC41INV __attribute__((section("sfrs"),address(0xBF8103DC)));
#define IPC45 IPC45
extern volatile uint32_t   IPC45 __attribute__((section("sfrs"), address(0xBF810410)));
typedef union {
  struct {
    uint32_t :16;
    uint32_t DMA4IS:2;
    uint32_t DMA4IP:3;
    uint32_t :3;
    uint32_t DMA5IS:2;
    uint32_t DMA5IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC45bits_t;
extern volatile __IPC45bits_t IPC45bits __asm__ ("IPC45") __attribute__((section("sfrs"), address(0xBF810410)));
extern volatile uint32_t        IPC45CLR __attribute__((section("sfrs"),address(0xBF810414)));
extern volatile uint32_t        IPC45SET __attribute__((section("sfrs"),address(0xBF810418)));
extern volatile uint32_t        IPC45INV __attribute__((section("sfrs"),address(0xBF81041C)));
#define IPC46 IPC46
extern volatile uint32_t   IPC46 __attribute__((section("sfrs"), address(0xBF810420)));
typedef union {
  struct {
    uint32_t DMA6IS:2;
    uint32_t DMA6IP:3;
    uint32_t :3;
    uint32_t DMA7IS:2;
    uint32_t DMA7IP:3;
  };
  struct {
    uint32_t w:32;
  };
} __IPC46bits_t;
