Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph048.h
extern volatile __CFD1FIFOCON3bits_t CFD1FIFOCON3bits __asm__ ("CFD1FIFOCON3") __attribute__((section("sfrs"), address(0xBF8801D0)));
extern volatile uint32_t        CFD1FIFOCON3CLR __attribute__((section("sfrs"),address(0xBF8801D4)));
extern volatile uint32_t        CFD1FIFOCON3SET __attribute__((section("sfrs"),address(0xBF8801D8)));
extern volatile uint32_t        CFD1FIFOCON3INV __attribute__((section("sfrs"),address(0xBF8801DC)));
#define CFD1FIFOSTA3 CFD1FIFOSTA3
extern volatile uint32_t   CFD1FIFOSTA3 __attribute__((section("sfrs"), address(0xBF8801E0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA3bits_t;
extern volatile __CFD1FIFOSTA3bits_t CFD1FIFOSTA3bits __asm__ ("CFD1FIFOSTA3") __attribute__((section("sfrs"), address(0xBF8801E0)));
extern volatile uint32_t        CFD1FIFOSTA3CLR __attribute__((section("sfrs"),address(0xBF8801E4)));
extern volatile uint32_t        CFD1FIFOSTA3SET __attribute__((section("sfrs"),address(0xBF8801E8)));
extern volatile uint32_t        CFD1FIFOSTA3INV __attribute__((section("sfrs"),address(0xBF8801EC)));
#define CFD1FIFOUA3 CFD1FIFOUA3
extern volatile uint32_t   CFD1FIFOUA3 __attribute__((section("sfrs"), address(0xBF8801F0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA3bits_t;
extern volatile __CFD1FIFOUA3bits_t CFD1FIFOUA3bits __asm__ ("CFD1FIFOUA3") __attribute__((section("sfrs"), address(0xBF8801F0)));
extern volatile uint32_t        CFD1FIFOUA3CLR __attribute__((section("sfrs"),address(0xBF8801F4)));
extern volatile uint32_t        CFD1FIFOUA3SET __attribute__((section("sfrs"),address(0xBF8801F8)));
extern volatile uint32_t        CFD1FIFOUA3INV __attribute__((section("sfrs"),address(0xBF8801FC)));
#define CFD1FIFOCON4 CFD1FIFOCON4
extern volatile uint32_t   CFD1FIFOCON4 __attribute__((section("sfrs"), address(0xBF880200)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON4bits_t;
extern volatile __CFD1FIFOCON4bits_t CFD1FIFOCON4bits __asm__ ("CFD1FIFOCON4") __attribute__((section("sfrs"), address(0xBF880200)));
extern volatile uint32_t        CFD1FIFOCON4CLR __attribute__((section("sfrs"),address(0xBF880204)));
extern volatile uint32_t        CFD1FIFOCON4SET __attribute__((section("sfrs"),address(0xBF880208)));
extern volatile uint32_t        CFD1FIFOCON4INV __attribute__((section("sfrs"),address(0xBF88020C)));
#define CFD1FIFOSTA4 CFD1FIFOSTA4
extern volatile uint32_t   CFD1FIFOSTA4 __attribute__((section("sfrs"), address(0xBF880210)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA4bits_t;
extern volatile __CFD1FIFOSTA4bits_t CFD1FIFOSTA4bits __asm__ ("CFD1FIFOSTA4") __attribute__((section("sfrs"), address(0xBF880210)));
extern volatile uint32_t        CFD1FIFOSTA4CLR __attribute__((section("sfrs"),address(0xBF880214)));
extern volatile uint32_t        CFD1FIFOSTA4SET __attribute__((section("sfrs"),address(0xBF880218)));
extern volatile uint32_t        CFD1FIFOSTA4INV __attribute__((section("sfrs"),address(0xBF88021C)));
#define CFD1FIFOUA4 CFD1FIFOUA4
extern volatile uint32_t   CFD1FIFOUA4 __attribute__((section("sfrs"), address(0xBF880220)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA4bits_t;
extern volatile __CFD1FIFOUA4bits_t CFD1FIFOUA4bits __asm__ ("CFD1FIFOUA4") __attribute__((section("sfrs"), address(0xBF880220)));
extern volatile uint32_t        CFD1FIFOUA4CLR __attribute__((section("sfrs"),address(0xBF880224)));
extern volatile uint32_t        CFD1FIFOUA4SET __attribute__((section("sfrs"),address(0xBF880228)));
extern volatile uint32_t        CFD1FIFOUA4INV __attribute__((section("sfrs"),address(0xBF88022C)));
#define CFD1FIFOCON5 CFD1FIFOCON5
extern volatile uint32_t   CFD1FIFOCON5 __attribute__((section("sfrs"), address(0xBF880230)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON5bits_t;
extern volatile __CFD1FIFOCON5bits_t CFD1FIFOCON5bits __asm__ ("CFD1FIFOCON5") __attribute__((section("sfrs"), address(0xBF880230)));
extern volatile uint32_t        CFD1FIFOCON5CLR __attribute__((section("sfrs"),address(0xBF880234)));
extern volatile uint32_t        CFD1FIFOCON5SET __attribute__((section("sfrs"),address(0xBF880238)));
extern volatile uint32_t        CFD1FIFOCON5INV __attribute__((section("sfrs"),address(0xBF88023C)));
#define CFD1FIFOSTA5 CFD1FIFOSTA5
extern volatile uint32_t   CFD1FIFOSTA5 __attribute__((section("sfrs"), address(0xBF880240)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA5bits_t;
extern volatile __CFD1FIFOSTA5bits_t CFD1FIFOSTA5bits __asm__ ("CFD1FIFOSTA5") __attribute__((section("sfrs"), address(0xBF880240)));
extern volatile uint32_t        CFD1FIFOSTA5CLR __attribute__((section("sfrs"),address(0xBF880244)));
extern volatile uint32_t        CFD1FIFOSTA5SET __attribute__((section("sfrs"),address(0xBF880248)));
extern volatile uint32_t        CFD1FIFOSTA5INV __attribute__((section("sfrs"),address(0xBF88024C)));
#define CFD1FIFOUA5 CFD1FIFOUA5
extern volatile uint32_t   CFD1FIFOUA5 __attribute__((section("sfrs"), address(0xBF880250)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA5bits_t;
extern volatile __CFD1FIFOUA5bits_t CFD1FIFOUA5bits __asm__ ("CFD1FIFOUA5") __attribute__((section("sfrs"), address(0xBF880250)));
extern volatile uint32_t        CFD1FIFOUA5CLR __attribute__((section("sfrs"),address(0xBF880254)));
extern volatile uint32_t        CFD1FIFOUA5SET __attribute__((section("sfrs"),address(0xBF880258)));
extern volatile uint32_t        CFD1FIFOUA5INV __attribute__((section("sfrs"),address(0xBF88025C)));
#define CFD1FIFOCON6 CFD1FIFOCON6
extern volatile uint32_t   CFD1FIFOCON6 __attribute__((section("sfrs"), address(0xBF880260)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON6bits_t;
extern volatile __CFD1FIFOCON6bits_t CFD1FIFOCON6bits __asm__ ("CFD1FIFOCON6") __attribute__((section("sfrs"), address(0xBF880260)));
extern volatile uint32_t        CFD1FIFOCON6CLR __attribute__((section("sfrs"),address(0xBF880264)));
extern volatile uint32_t        CFD1FIFOCON6SET __attribute__((section("sfrs"),address(0xBF880268)));
extern volatile uint32_t        CFD1FIFOCON6INV __attribute__((section("sfrs"),address(0xBF88026C)));
#define CFD1FIFOSTA6 CFD1FIFOSTA6
extern volatile uint32_t   CFD1FIFOSTA6 __attribute__((section("sfrs"), address(0xBF880270)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA6bits_t;
extern volatile __CFD1FIFOSTA6bits_t CFD1FIFOSTA6bits __asm__ ("CFD1FIFOSTA6") __attribute__((section("sfrs"), address(0xBF880270)));
extern volatile uint32_t        CFD1FIFOSTA6CLR __attribute__((section("sfrs"),address(0xBF880274)));
extern volatile uint32_t        CFD1FIFOSTA6SET __attribute__((section("sfrs"),address(0xBF880278)));
extern volatile uint32_t        CFD1FIFOSTA6INV __attribute__((section("sfrs"),address(0xBF88027C)));
#define CFD1FIFOUA6 CFD1FIFOUA6
extern volatile uint32_t   CFD1FIFOUA6 __attribute__((section("sfrs"), address(0xBF880280)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA6bits_t;
extern volatile __CFD1FIFOUA6bits_t CFD1FIFOUA6bits __asm__ ("CFD1FIFOUA6") __attribute__((section("sfrs"), address(0xBF880280)));
extern volatile uint32_t        CFD1FIFOUA6CLR __attribute__((section("sfrs"),address(0xBF880284)));
extern volatile uint32_t        CFD1FIFOUA6SET __attribute__((section("sfrs"),address(0xBF880288)));
extern volatile uint32_t        CFD1FIFOUA6INV __attribute__((section("sfrs"),address(0xBF88028C)));
#define CFD1FIFOCON7 CFD1FIFOCON7
extern volatile uint32_t   CFD1FIFOCON7 __attribute__((section("sfrs"), address(0xBF880290)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON7bits_t;
extern volatile __CFD1FIFOCON7bits_t CFD1FIFOCON7bits __asm__ ("CFD1FIFOCON7") __attribute__((section("sfrs"), address(0xBF880290)));
extern volatile uint32_t        CFD1FIFOCON7CLR __attribute__((section("sfrs"),address(0xBF880294)));
extern volatile uint32_t        CFD1FIFOCON7SET __attribute__((section("sfrs"),address(0xBF880298)));
extern volatile uint32_t        CFD1FIFOCON7INV __attribute__((section("sfrs"),address(0xBF88029C)));
#define CFD1FIFOSTA7 CFD1FIFOSTA7
extern volatile uint32_t   CFD1FIFOSTA7 __attribute__((section("sfrs"), address(0xBF8802A0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA7bits_t;
