Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph048.h
extern volatile __CFD1FIFOUA11bits_t CFD1FIFOUA11bits __asm__ ("CFD1FIFOUA11") __attribute__((section("sfrs"), address(0xBF880370)));
extern volatile uint32_t        CFD1FIFOUA11CLR __attribute__((section("sfrs"),address(0xBF880374)));
extern volatile uint32_t        CFD1FIFOUA11SET __attribute__((section("sfrs"),address(0xBF880378)));
extern volatile uint32_t        CFD1FIFOUA11INV __attribute__((section("sfrs"),address(0xBF88037C)));
#define CFD1FIFOCON12 CFD1FIFOCON12
extern volatile uint32_t   CFD1FIFOCON12 __attribute__((section("sfrs"), address(0xBF880380)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON12bits_t;
extern volatile __CFD1FIFOCON12bits_t CFD1FIFOCON12bits __asm__ ("CFD1FIFOCON12") __attribute__((section("sfrs"), address(0xBF880380)));
extern volatile uint32_t        CFD1FIFOCON12CLR __attribute__((section("sfrs"),address(0xBF880384)));
extern volatile uint32_t        CFD1FIFOCON12SET __attribute__((section("sfrs"),address(0xBF880388)));
extern volatile uint32_t        CFD1FIFOCON12INV __attribute__((section("sfrs"),address(0xBF88038C)));
#define CFD1FIFOSTA12 CFD1FIFOSTA12
extern volatile uint32_t   CFD1FIFOSTA12 __attribute__((section("sfrs"), address(0xBF880390)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA12bits_t;
extern volatile __CFD1FIFOSTA12bits_t CFD1FIFOSTA12bits __asm__ ("CFD1FIFOSTA12") __attribute__((section("sfrs"), address(0xBF880390)));
extern volatile uint32_t        CFD1FIFOSTA12CLR __attribute__((section("sfrs"),address(0xBF880394)));
extern volatile uint32_t        CFD1FIFOSTA12SET __attribute__((section("sfrs"),address(0xBF880398)));
extern volatile uint32_t        CFD1FIFOSTA12INV __attribute__((section("sfrs"),address(0xBF88039C)));
#define CFD1FIFOUA12 CFD1FIFOUA12
extern volatile uint32_t   CFD1FIFOUA12 __attribute__((section("sfrs"), address(0xBF8803A0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA12bits_t;
extern volatile __CFD1FIFOUA12bits_t CFD1FIFOUA12bits __asm__ ("CFD1FIFOUA12") __attribute__((section("sfrs"), address(0xBF8803A0)));
extern volatile uint32_t        CFD1FIFOUA12CLR __attribute__((section("sfrs"),address(0xBF8803A4)));
extern volatile uint32_t        CFD1FIFOUA12SET __attribute__((section("sfrs"),address(0xBF8803A8)));
extern volatile uint32_t        CFD1FIFOUA12INV __attribute__((section("sfrs"),address(0xBF8803AC)));
#define CFD1FIFOCON13 CFD1FIFOCON13
extern volatile uint32_t   CFD1FIFOCON13 __attribute__((section("sfrs"), address(0xBF8803B0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON13bits_t;
extern volatile __CFD1FIFOCON13bits_t CFD1FIFOCON13bits __asm__ ("CFD1FIFOCON13") __attribute__((section("sfrs"), address(0xBF8803B0)));
extern volatile uint32_t        CFD1FIFOCON13CLR __attribute__((section("sfrs"),address(0xBF8803B4)));
extern volatile uint32_t        CFD1FIFOCON13SET __attribute__((section("sfrs"),address(0xBF8803B8)));
extern volatile uint32_t        CFD1FIFOCON13INV __attribute__((section("sfrs"),address(0xBF8803BC)));
#define CFD1FIFOSTA13 CFD1FIFOSTA13
extern volatile uint32_t   CFD1FIFOSTA13 __attribute__((section("sfrs"), address(0xBF8803C0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA13bits_t;
extern volatile __CFD1FIFOSTA13bits_t CFD1FIFOSTA13bits __asm__ ("CFD1FIFOSTA13") __attribute__((section("sfrs"), address(0xBF8803C0)));
extern volatile uint32_t        CFD1FIFOSTA13CLR __attribute__((section("sfrs"),address(0xBF8803C4)));
extern volatile uint32_t        CFD1FIFOSTA13SET __attribute__((section("sfrs"),address(0xBF8803C8)));
extern volatile uint32_t        CFD1FIFOSTA13INV __attribute__((section("sfrs"),address(0xBF8803CC)));
#define CFD1FIFOUA13 CFD1FIFOUA13
extern volatile uint32_t   CFD1FIFOUA13 __attribute__((section("sfrs"), address(0xBF8803D0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA13bits_t;
extern volatile __CFD1FIFOUA13bits_t CFD1FIFOUA13bits __asm__ ("CFD1FIFOUA13") __attribute__((section("sfrs"), address(0xBF8803D0)));
extern volatile uint32_t        CFD1FIFOUA13CLR __attribute__((section("sfrs"),address(0xBF8803D4)));
extern volatile uint32_t        CFD1FIFOUA13SET __attribute__((section("sfrs"),address(0xBF8803D8)));
extern volatile uint32_t        CFD1FIFOUA13INV __attribute__((section("sfrs"),address(0xBF8803DC)));
#define CFD1FIFOCON14 CFD1FIFOCON14
extern volatile uint32_t   CFD1FIFOCON14 __attribute__((section("sfrs"), address(0xBF8803E0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON14bits_t;
extern volatile __CFD1FIFOCON14bits_t CFD1FIFOCON14bits __asm__ ("CFD1FIFOCON14") __attribute__((section("sfrs"), address(0xBF8803E0)));
extern volatile uint32_t        CFD1FIFOCON14CLR __attribute__((section("sfrs"),address(0xBF8803E4)));
extern volatile uint32_t        CFD1FIFOCON14SET __attribute__((section("sfrs"),address(0xBF8803E8)));
extern volatile uint32_t        CFD1FIFOCON14INV __attribute__((section("sfrs"),address(0xBF8803EC)));
#define CFD1FIFOSTA14 CFD1FIFOSTA14
extern volatile uint32_t   CFD1FIFOSTA14 __attribute__((section("sfrs"), address(0xBF8803F0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA14bits_t;
extern volatile __CFD1FIFOSTA14bits_t CFD1FIFOSTA14bits __asm__ ("CFD1FIFOSTA14") __attribute__((section("sfrs"), address(0xBF8803F0)));
extern volatile uint32_t        CFD1FIFOSTA14CLR __attribute__((section("sfrs"),address(0xBF8803F4)));
extern volatile uint32_t        CFD1FIFOSTA14SET __attribute__((section("sfrs"),address(0xBF8803F8)));
extern volatile uint32_t        CFD1FIFOSTA14INV __attribute__((section("sfrs"),address(0xBF8803FC)));
#define CFD1FIFOUA14 CFD1FIFOUA14
extern volatile uint32_t   CFD1FIFOUA14 __attribute__((section("sfrs"), address(0xBF880400)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA14bits_t;
