Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph048.h
extern volatile __CFD1FIFOCON27bits_t CFD1FIFOCON27bits __asm__ ("CFD1FIFOCON27") __attribute__((section("sfrs"), address(0xBF880650)));
extern volatile uint32_t        CFD1FIFOCON27CLR __attribute__((section("sfrs"),address(0xBF880654)));
extern volatile uint32_t        CFD1FIFOCON27SET __attribute__((section("sfrs"),address(0xBF880658)));
extern volatile uint32_t        CFD1FIFOCON27INV __attribute__((section("sfrs"),address(0xBF88065C)));
#define CFD1FIFOSTA27 CFD1FIFOSTA27
extern volatile uint32_t   CFD1FIFOSTA27 __attribute__((section("sfrs"), address(0xBF880660)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA27bits_t;
extern volatile __CFD1FIFOSTA27bits_t CFD1FIFOSTA27bits __asm__ ("CFD1FIFOSTA27") __attribute__((section("sfrs"), address(0xBF880660)));
extern volatile uint32_t        CFD1FIFOSTA27CLR __attribute__((section("sfrs"),address(0xBF880664)));
extern volatile uint32_t        CFD1FIFOSTA27SET __attribute__((section("sfrs"),address(0xBF880668)));
extern volatile uint32_t        CFD1FIFOSTA27INV __attribute__((section("sfrs"),address(0xBF88066C)));
#define CFD1FIFOUA27 CFD1FIFOUA27
extern volatile uint32_t   CFD1FIFOUA27 __attribute__((section("sfrs"), address(0xBF880670)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA27bits_t;
extern volatile __CFD1FIFOUA27bits_t CFD1FIFOUA27bits __asm__ ("CFD1FIFOUA27") __attribute__((section("sfrs"), address(0xBF880670)));
extern volatile uint32_t        CFD1FIFOUA27CLR __attribute__((section("sfrs"),address(0xBF880674)));
extern volatile uint32_t        CFD1FIFOUA27SET __attribute__((section("sfrs"),address(0xBF880678)));
extern volatile uint32_t        CFD1FIFOUA27INV __attribute__((section("sfrs"),address(0xBF88067C)));
#define CFD1FIFOCON28 CFD1FIFOCON28
extern volatile uint32_t   CFD1FIFOCON28 __attribute__((section("sfrs"), address(0xBF880680)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON28bits_t;
extern volatile __CFD1FIFOCON28bits_t CFD1FIFOCON28bits __asm__ ("CFD1FIFOCON28") __attribute__((section("sfrs"), address(0xBF880680)));
extern volatile uint32_t        CFD1FIFOCON28CLR __attribute__((section("sfrs"),address(0xBF880684)));
extern volatile uint32_t        CFD1FIFOCON28SET __attribute__((section("sfrs"),address(0xBF880688)));
extern volatile uint32_t        CFD1FIFOCON28INV __attribute__((section("sfrs"),address(0xBF88068C)));
#define CFD1FIFOSTA28 CFD1FIFOSTA28
extern volatile uint32_t   CFD1FIFOSTA28 __attribute__((section("sfrs"), address(0xBF880690)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA28bits_t;
extern volatile __CFD1FIFOSTA28bits_t CFD1FIFOSTA28bits __asm__ ("CFD1FIFOSTA28") __attribute__((section("sfrs"), address(0xBF880690)));
extern volatile uint32_t        CFD1FIFOSTA28CLR __attribute__((section("sfrs"),address(0xBF880694)));
extern volatile uint32_t        CFD1FIFOSTA28SET __attribute__((section("sfrs"),address(0xBF880698)));
extern volatile uint32_t        CFD1FIFOSTA28INV __attribute__((section("sfrs"),address(0xBF88069C)));
#define CFD1FIFOUA28 CFD1FIFOUA28
extern volatile uint32_t   CFD1FIFOUA28 __attribute__((section("sfrs"), address(0xBF8806A0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA28bits_t;
extern volatile __CFD1FIFOUA28bits_t CFD1FIFOUA28bits __asm__ ("CFD1FIFOUA28") __attribute__((section("sfrs"), address(0xBF8806A0)));
extern volatile uint32_t        CFD1FIFOUA28CLR __attribute__((section("sfrs"),address(0xBF8806A4)));
extern volatile uint32_t        CFD1FIFOUA28SET __attribute__((section("sfrs"),address(0xBF8806A8)));
extern volatile uint32_t        CFD1FIFOUA28INV __attribute__((section("sfrs"),address(0xBF8806AC)));
#define CFD1FIFOCON29 CFD1FIFOCON29
extern volatile uint32_t   CFD1FIFOCON29 __attribute__((section("sfrs"), address(0xBF8806B0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON29bits_t;
extern volatile __CFD1FIFOCON29bits_t CFD1FIFOCON29bits __asm__ ("CFD1FIFOCON29") __attribute__((section("sfrs"), address(0xBF8806B0)));
extern volatile uint32_t        CFD1FIFOCON29CLR __attribute__((section("sfrs"),address(0xBF8806B4)));
extern volatile uint32_t        CFD1FIFOCON29SET __attribute__((section("sfrs"),address(0xBF8806B8)));
extern volatile uint32_t        CFD1FIFOCON29INV __attribute__((section("sfrs"),address(0xBF8806BC)));
#define CFD1FIFOSTA29 CFD1FIFOSTA29
extern volatile uint32_t   CFD1FIFOSTA29 __attribute__((section("sfrs"), address(0xBF8806C0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA29bits_t;
extern volatile __CFD1FIFOSTA29bits_t CFD1FIFOSTA29bits __asm__ ("CFD1FIFOSTA29") __attribute__((section("sfrs"), address(0xBF8806C0)));
extern volatile uint32_t        CFD1FIFOSTA29CLR __attribute__((section("sfrs"),address(0xBF8806C4)));
extern volatile uint32_t        CFD1FIFOSTA29SET __attribute__((section("sfrs"),address(0xBF8806C8)));
extern volatile uint32_t        CFD1FIFOSTA29INV __attribute__((section("sfrs"),address(0xBF8806CC)));
#define CFD1FIFOUA29 CFD1FIFOUA29
extern volatile uint32_t   CFD1FIFOUA29 __attribute__((section("sfrs"), address(0xBF8806D0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA29bits_t;
extern volatile __CFD1FIFOUA29bits_t CFD1FIFOUA29bits __asm__ ("CFD1FIFOUA29") __attribute__((section("sfrs"), address(0xBF8806D0)));
extern volatile uint32_t        CFD1FIFOUA29CLR __attribute__((section("sfrs"),address(0xBF8806D4)));
extern volatile uint32_t        CFD1FIFOUA29SET __attribute__((section("sfrs"),address(0xBF8806D8)));
extern volatile uint32_t        CFD1FIFOUA29INV __attribute__((section("sfrs"),address(0xBF8806DC)));
#define CFD1FIFOCON30 CFD1FIFOCON30
extern volatile uint32_t   CFD1FIFOCON30 __attribute__((section("sfrs"), address(0xBF8806E0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD1FIFOCON30bits_t;
extern volatile __CFD1FIFOCON30bits_t CFD1FIFOCON30bits __asm__ ("CFD1FIFOCON30") __attribute__((section("sfrs"), address(0xBF8806E0)));
extern volatile uint32_t        CFD1FIFOCON30CLR __attribute__((section("sfrs"),address(0xBF8806E4)));
extern volatile uint32_t        CFD1FIFOCON30SET __attribute__((section("sfrs"),address(0xBF8806E8)));
extern volatile uint32_t        CFD1FIFOCON30INV __attribute__((section("sfrs"),address(0xBF8806EC)));
#define CFD1FIFOSTA30 CFD1FIFOSTA30
extern volatile uint32_t   CFD1FIFOSTA30 __attribute__((section("sfrs"), address(0xBF8806F0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD1FIFOSTA30bits_t;
extern volatile __CFD1FIFOSTA30bits_t CFD1FIFOSTA30bits __asm__ ("CFD1FIFOSTA30") __attribute__((section("sfrs"), address(0xBF8806F0)));
extern volatile uint32_t        CFD1FIFOSTA30CLR __attribute__((section("sfrs"),address(0xBF8806F4)));
extern volatile uint32_t        CFD1FIFOSTA30SET __attribute__((section("sfrs"),address(0xBF8806F8)));
extern volatile uint32_t        CFD1FIFOSTA30INV __attribute__((section("sfrs"),address(0xBF8806FC)));
#define CFD1FIFOUA30 CFD1FIFOUA30
extern volatile uint32_t   CFD1FIFOUA30 __attribute__((section("sfrs"), address(0xBF880700)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD1FIFOUA30bits_t;
