Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph048.h
#define _CFD1FLTCON2_FLTEN11_POSITION            0x0000001F
#define _CFD1FLTCON2_FLTEN11_MASK                0x80000000
#define _CFD1FLTCON2_FLTEN11_LENGTH              0x00000001

#define _CFD1FLTCON3_F12BP_POSITION              0x00000000
#define _CFD1FLTCON3_F12BP_MASK                  0x0000001F
#define _CFD1FLTCON3_F12BP_LENGTH                0x00000005

#define _CFD1FLTCON3_FLTEN12_POSITION            0x00000007
#define _CFD1FLTCON3_FLTEN12_MASK                0x00000080
#define _CFD1FLTCON3_FLTEN12_LENGTH              0x00000001

#define _CFD1FLTCON3_F13BP_POSITION              0x00000008
#define _CFD1FLTCON3_F13BP_MASK                  0x00001F00
#define _CFD1FLTCON3_F13BP_LENGTH                0x00000005

#define _CFD1FLTCON3_FLTEN13_POSITION            0x0000000F
#define _CFD1FLTCON3_FLTEN13_MASK                0x00008000
#define _CFD1FLTCON3_FLTEN13_LENGTH              0x00000001

#define _CFD1FLTCON3_F14BP_POSITION              0x00000010
#define _CFD1FLTCON3_F14BP_MASK                  0x001F0000
#define _CFD1FLTCON3_F14BP_LENGTH                0x00000005

#define _CFD1FLTCON3_FLTEN14_POSITION            0x00000017
#define _CFD1FLTCON3_FLTEN14_MASK                0x00800000
#define _CFD1FLTCON3_FLTEN14_LENGTH              0x00000001

#define _CFD1FLTCON3_F15BP_POSITION              0x00000018
#define _CFD1FLTCON3_F15BP_MASK                  0x1F000000
#define _CFD1FLTCON3_F15BP_LENGTH                0x00000005

#define _CFD1FLTCON3_FLTEN15_POSITION            0x0000001F
#define _CFD1FLTCON3_FLTEN15_MASK                0x80000000
#define _CFD1FLTCON3_FLTEN15_LENGTH              0x00000001

#define _CFD1FLTCON4_F16BP_POSITION              0x00000000
#define _CFD1FLTCON4_F16BP_MASK                  0x0000001F
#define _CFD1FLTCON4_F16BP_LENGTH                0x00000005

#define _CFD1FLTCON4_FLTEN16_POSITION            0x00000007
#define _CFD1FLTCON4_FLTEN16_MASK                0x00000080
#define _CFD1FLTCON4_FLTEN16_LENGTH              0x00000001

#define _CFD1FLTCON4_F17BP_POSITION              0x00000008
#define _CFD1FLTCON4_F17BP_MASK                  0x00001F00
#define _CFD1FLTCON4_F17BP_LENGTH                0x00000005

#define _CFD1FLTCON4_FLTEN17_POSITION            0x0000000F
#define _CFD1FLTCON4_FLTEN17_MASK                0x00008000
#define _CFD1FLTCON4_FLTEN17_LENGTH              0x00000001

#define _CFD1FLTCON4_F18BP_POSITION              0x00000010
#define _CFD1FLTCON4_F18BP_MASK                  0x001F0000
#define _CFD1FLTCON4_F18BP_LENGTH                0x00000005

#define _CFD1FLTCON4_FLTEN18_POSITION            0x00000017
#define _CFD1FLTCON4_FLTEN18_MASK                0x00800000
#define _CFD1FLTCON4_FLTEN18_LENGTH              0x00000001

#define _CFD1FLTCON4_F19BP_POSITION              0x00000018
#define _CFD1FLTCON4_F19BP_MASK                  0x1F000000
#define _CFD1FLTCON4_F19BP_LENGTH                0x00000005

#define _CFD1FLTCON4_FLTEN19_POSITION            0x0000001F
#define _CFD1FLTCON4_FLTEN19_MASK                0x80000000
#define _CFD1FLTCON4_FLTEN19_LENGTH              0x00000001

#define _CFD1FLTCON5_F20BP_POSITION              0x00000000
#define _CFD1FLTCON5_F20BP_MASK                  0x0000001F
#define _CFD1FLTCON5_F20BP_LENGTH                0x00000005

#define _CFD1FLTCON5_FLTEN20_POSITION            0x00000007
#define _CFD1FLTCON5_FLTEN20_MASK                0x00000080
#define _CFD1FLTCON5_FLTEN20_LENGTH              0x00000001

#define _CFD1FLTCON5_F21BP_POSITION              0x00000008
#define _CFD1FLTCON5_F21BP_MASK                  0x00001F00
#define _CFD1FLTCON5_F21BP_LENGTH                0x00000005

#define _CFD1FLTCON5_FLTEN21_POSITION            0x0000000F
#define _CFD1FLTCON5_FLTEN21_MASK                0x00008000
#define _CFD1FLTCON5_FLTEN21_LENGTH              0x00000001

#define _CFD1FLTCON5_F22BP_POSITION              0x00000010
#define _CFD1FLTCON5_F22BP_MASK                  0x001F0000
#define _CFD1FLTCON5_F22BP_LENGTH                0x00000005

#define _CFD1FLTCON5_FLTEN22_POSITION            0x00000017
#define _CFD1FLTCON5_FLTEN22_MASK                0x00800000
#define _CFD1FLTCON5_FLTEN22_LENGTH              0x00000001

#define _CFD1FLTCON5_F23BP_POSITION              0x00000018
#define _CFD1FLTCON5_F23BP_MASK                  0x1F000000
#define _CFD1FLTCON5_F23BP_LENGTH                0x00000005

#define _CFD1FLTCON5_FLTEN23_POSITION            0x0000001F
#define _CFD1FLTCON5_FLTEN23_MASK                0x80000000
#define _CFD1FLTCON5_FLTEN23_LENGTH              0x00000001

#define _CFD1FLTCON6_F24BP_POSITION              0x00000000
#define _CFD1FLTCON6_F24BP_MASK                  0x0000001F
#define _CFD1FLTCON6_F24BP_LENGTH                0x00000005

#define _CFD1FLTCON6_FLTEN24_POSITION            0x00000007
#define _CFD1FLTCON6_FLTEN24_MASK                0x00000080
#define _CFD1FLTCON6_FLTEN24_LENGTH              0x00000001

#define _CFD1FLTCON6_F25BP_POSITION              0x00000008
#define _CFD1FLTCON6_F25BP_MASK                  0x00001F00
#define _CFD1FLTCON6_F25BP_LENGTH                0x00000005

#define _CFD1FLTCON6_FLTEN25_POSITION            0x0000000F
#define _CFD1FLTCON6_FLTEN25_MASK                0x00008000
#define _CFD1FLTCON6_FLTEN25_LENGTH              0x00000001

#define _CFD1FLTCON6_F26BP_POSITION              0x00000010
#define _CFD1FLTCON6_F26BP_MASK                  0x001F0000
#define _CFD1FLTCON6_F26BP_LENGTH                0x00000005

#define _CFD1FLTCON6_FLTEN26_POSITION            0x00000017
#define _CFD1FLTCON6_FLTEN26_MASK                0x00800000
#define _CFD1FLTCON6_FLTEN26_LENGTH              0x00000001

#define _CFD1FLTCON6_F27BP_POSITION              0x00000018
#define _CFD1FLTCON6_F27BP_MASK                  0x1F000000
#define _CFD1FLTCON6_F27BP_LENGTH                0x00000005

#define _CFD1FLTCON6_FLTEN27_POSITION            0x0000001F
#define _CFD1FLTCON6_FLTEN27_MASK                0x80000000
#define _CFD1FLTCON6_FLTEN27_LENGTH              0x00000001

#define _CFD1FLTCON7_F28BP_POSITION              0x00000000
#define _CFD1FLTCON7_F28BP_MASK                  0x0000001F
#define _CFD1FLTCON7_F28BP_LENGTH                0x00000005

