Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph048.h
#define _CFD1FLTOBJ13_SID_POSITION               0x00000000
#define _CFD1FLTOBJ13_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ13_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ13_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ13_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ13_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ13_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ13_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ13_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ13_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ13_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ13_EXIDE_LENGTH               0x00000001

#define _CFD1MASK13_MSID_POSITION                0x00000000
#define _CFD1MASK13_MSID_MASK                    0x000007FF
#define _CFD1MASK13_MSID_LENGTH                  0x0000000B

#define _CFD1MASK13_MEID_POSITION                0x0000000B
#define _CFD1MASK13_MEID_MASK                    0x1FFFF800
#define _CFD1MASK13_MEID_LENGTH                  0x00000012

#define _CFD1MASK13_MSID11_POSITION              0x0000001D
#define _CFD1MASK13_MSID11_MASK                  0x20000000
#define _CFD1MASK13_MSID11_LENGTH                0x00000001

#define _CFD1MASK13_MIDE_POSITION                0x0000001E
#define _CFD1MASK13_MIDE_MASK                    0x40000000
#define _CFD1MASK13_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ14_SID_POSITION               0x00000000
#define _CFD1FLTOBJ14_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ14_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ14_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ14_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ14_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ14_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ14_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ14_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ14_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ14_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ14_EXIDE_LENGTH               0x00000001

#define _CFD1MASK14_MSID_POSITION                0x00000000
#define _CFD1MASK14_MSID_MASK                    0x000007FF
#define _CFD1MASK14_MSID_LENGTH                  0x0000000B

#define _CFD1MASK14_MEID_POSITION                0x0000000B
#define _CFD1MASK14_MEID_MASK                    0x1FFFF800
#define _CFD1MASK14_MEID_LENGTH                  0x00000012

#define _CFD1MASK14_MSID11_POSITION              0x0000001D
#define _CFD1MASK14_MSID11_MASK                  0x20000000
#define _CFD1MASK14_MSID11_LENGTH                0x00000001

#define _CFD1MASK14_MIDE_POSITION                0x0000001E
#define _CFD1MASK14_MIDE_MASK                    0x40000000
#define _CFD1MASK14_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ15_SID_POSITION               0x00000000
#define _CFD1FLTOBJ15_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ15_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ15_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ15_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ15_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ15_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ15_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ15_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ15_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ15_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ15_EXIDE_LENGTH               0x00000001

#define _CFD1MASK15_MSID_POSITION                0x00000000
#define _CFD1MASK15_MSID_MASK                    0x000007FF
#define _CFD1MASK15_MSID_LENGTH                  0x0000000B

#define _CFD1MASK15_MEID_POSITION                0x0000000B
#define _CFD1MASK15_MEID_MASK                    0x1FFFF800
#define _CFD1MASK15_MEID_LENGTH                  0x00000012

#define _CFD1MASK15_MSID11_POSITION              0x0000001D
#define _CFD1MASK15_MSID11_MASK                  0x20000000
#define _CFD1MASK15_MSID11_LENGTH                0x00000001

#define _CFD1MASK15_MIDE_POSITION                0x0000001E
#define _CFD1MASK15_MIDE_MASK                    0x40000000
#define _CFD1MASK15_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ16_SID_POSITION               0x00000000
#define _CFD1FLTOBJ16_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ16_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ16_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ16_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ16_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ16_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ16_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ16_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ16_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ16_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ16_EXIDE_LENGTH               0x00000001

#define _CFD1MASK16_MSID_POSITION                0x00000000
#define _CFD1MASK16_MSID_MASK                    0x000007FF
#define _CFD1MASK16_MSID_LENGTH                  0x0000000B

#define _CFD1MASK16_MEID_POSITION                0x0000000B
#define _CFD1MASK16_MEID_MASK                    0x1FFFF800
#define _CFD1MASK16_MEID_LENGTH                  0x00000012

#define _CFD1MASK16_MSID11_POSITION              0x0000001D
#define _CFD1MASK16_MSID11_MASK                  0x20000000
#define _CFD1MASK16_MSID11_LENGTH                0x00000001

#define _CFD1MASK16_MIDE_POSITION                0x0000001E
#define _CFD1MASK16_MIDE_MASK                    0x40000000
#define _CFD1MASK16_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ17_SID_POSITION               0x00000000
#define _CFD1FLTOBJ17_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ17_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ17_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ17_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ17_EID_LENGTH                 0x00000012

