Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.83/include/proc/p32mk0256gph048.h
#define _ADEVCFG3_PMDL1WAY_POSITION              0x0000001C
#define _ADEVCFG3_PMDL1WAY_MASK                  0x10000000
#define _ADEVCFG3_PMDL1WAY_LENGTH                0x00000001

#define _ADEVCFG3_IOL1WAY_POSITION               0x0000001D
#define _ADEVCFG3_IOL1WAY_MASK                   0x20000000
#define _ADEVCFG3_IOL1WAY_LENGTH                 0x00000001

#define _ADEVCFG3_FUSBIDIO1_POSITION             0x0000001E
#define _ADEVCFG3_FUSBIDIO1_MASK                 0x40000000
#define _ADEVCFG3_FUSBIDIO1_LENGTH               0x00000001

#define _ADEVCFG3_FVBUSIO1_POSITION              0x0000001F
#define _ADEVCFG3_FVBUSIO1_MASK                  0x80000000
#define _ADEVCFG3_FVBUSIO1_LENGTH                0x00000001

#define _ADEVCFG3_w_POSITION                     0x00000000
#define _ADEVCFG3_w_MASK                         0xFFFFFFFF
#define _ADEVCFG3_w_LENGTH                       0x00000020

#define _ADEVCFG2_FPLLIDIV_POSITION              0x00000000
#define _ADEVCFG2_FPLLIDIV_MASK                  0x00000007
#define _ADEVCFG2_FPLLIDIV_LENGTH                0x00000003

#define _ADEVCFG2_FPLLRNG_POSITION               0x00000004
#define _ADEVCFG2_FPLLRNG_MASK                   0x00000070
#define _ADEVCFG2_FPLLRNG_LENGTH                 0x00000003

#define _ADEVCFG2_FPLLICLK_POSITION              0x00000007
#define _ADEVCFG2_FPLLICLK_MASK                  0x00000080
#define _ADEVCFG2_FPLLICLK_LENGTH                0x00000001

#define _ADEVCFG2_FPLLMULT_POSITION              0x00000008
#define _ADEVCFG2_FPLLMULT_MASK                  0x00007F00
#define _ADEVCFG2_FPLLMULT_LENGTH                0x00000007

#define _ADEVCFG2_FPLLODIV_POSITION              0x00000010
#define _ADEVCFG2_FPLLODIV_MASK                  0x00070000
#define _ADEVCFG2_FPLLODIV_LENGTH                0x00000003

#define _ADEVCFG2_DSBOREN_POSITION               0x00000014
#define _ADEVCFG2_DSBOREN_MASK                   0x00100000
#define _ADEVCFG2_DSBOREN_LENGTH                 0x00000001

#define _ADEVCFG2_DSWDTPS_POSITION               0x00000015
#define _ADEVCFG2_DSWDTPS_MASK                   0x03E00000
#define _ADEVCFG2_DSWDTPS_LENGTH                 0x00000005

#define _ADEVCFG2_DSWDTOSC_POSITION              0x0000001A
#define _ADEVCFG2_DSWDTOSC_MASK                  0x04000000
#define _ADEVCFG2_DSWDTOSC_LENGTH                0x00000001

#define _ADEVCFG2_DSWDTEN_POSITION               0x0000001B
#define _ADEVCFG2_DSWDTEN_MASK                   0x08000000
#define _ADEVCFG2_DSWDTEN_LENGTH                 0x00000001

#define _ADEVCFG2_FDSEN_POSITION                 0x0000001C
#define _ADEVCFG2_FDSEN_MASK                     0x10000000
#define _ADEVCFG2_FDSEN_LENGTH                   0x00000001

#define _ADEVCFG2_BORSEL_POSITION                0x0000001D
#define _ADEVCFG2_BORSEL_MASK                    0x20000000
#define _ADEVCFG2_BORSEL_LENGTH                  0x00000001

#define _ADEVCFG2_UPLLEN_POSITION                0x0000001F
#define _ADEVCFG2_UPLLEN_MASK                    0x80000000
#define _ADEVCFG2_UPLLEN_LENGTH                  0x00000001

#define _ADEVCFG2_w_POSITION                     0x00000000
#define _ADEVCFG2_w_MASK                         0xFFFFFFFF
#define _ADEVCFG2_w_LENGTH                       0x00000020

#define _ADEVCFG1_FNOSC_POSITION                 0x00000000
#define _ADEVCFG1_FNOSC_MASK                     0x00000007
#define _ADEVCFG1_FNOSC_LENGTH                   0x00000003

#define _ADEVCFG1_DMTINTV_POSITION               0x00000003
#define _ADEVCFG1_DMTINTV_MASK                   0x00000038
#define _ADEVCFG1_DMTINTV_LENGTH                 0x00000003

#define _ADEVCFG1_FSOSCEN_POSITION               0x00000006
#define _ADEVCFG1_FSOSCEN_MASK                   0x00000040
#define _ADEVCFG1_FSOSCEN_LENGTH                 0x00000001

#define _ADEVCFG1_IESO_POSITION                  0x00000007
#define _ADEVCFG1_IESO_MASK                      0x00000080
#define _ADEVCFG1_IESO_LENGTH                    0x00000001

#define _ADEVCFG1_POSCMOD_POSITION               0x00000008
#define _ADEVCFG1_POSCMOD_MASK                   0x00000300
#define _ADEVCFG1_POSCMOD_LENGTH                 0x00000002

#define _ADEVCFG1_OSCIOFNC_POSITION              0x0000000A
#define _ADEVCFG1_OSCIOFNC_MASK                  0x00000400
#define _ADEVCFG1_OSCIOFNC_LENGTH                0x00000001

#define _ADEVCFG1_FCKSM_POSITION                 0x0000000E
#define _ADEVCFG1_FCKSM_MASK                     0x0000C000
#define _ADEVCFG1_FCKSM_LENGTH                   0x00000002

#define _ADEVCFG1_WDTPS_POSITION                 0x00000010
#define _ADEVCFG1_WDTPS_MASK                     0x001F0000
#define _ADEVCFG1_WDTPS_LENGTH                   0x00000005

#define _ADEVCFG1_WDTSPGM_POSITION               0x00000015
#define _ADEVCFG1_WDTSPGM_MASK                   0x00200000
#define _ADEVCFG1_WDTSPGM_LENGTH                 0x00000001

#define _ADEVCFG1_WINDIS_POSITION                0x00000016
#define _ADEVCFG1_WINDIS_MASK                    0x00400000
#define _ADEVCFG1_WINDIS_LENGTH                  0x00000001

#define _ADEVCFG1_FWDTEN_POSITION                0x00000017
#define _ADEVCFG1_FWDTEN_MASK                    0x00800000
#define _ADEVCFG1_FWDTEN_LENGTH                  0x00000001

#define _ADEVCFG1_FWDTWINSZ_POSITION             0x00000018
#define _ADEVCFG1_FWDTWINSZ_MASK                 0x03000000
#define _ADEVCFG1_FWDTWINSZ_LENGTH               0x00000002

#define _ADEVCFG1_DMTCNT_POSITION                0x0000001A
#define _ADEVCFG1_DMTCNT_MASK                    0x7C000000
#define _ADEVCFG1_DMTCNT_LENGTH                  0x00000005

#define _ADEVCFG1_FDMTEN_POSITION                0x0000001F
#define _ADEVCFG1_FDMTEN_MASK                    0x80000000
#define _ADEVCFG1_FDMTEN_LENGTH                  0x00000001

#define _ADEVCFG1_w_POSITION                     0x00000000
#define _ADEVCFG1_w_MASK                         0xFFFFFFFF
#define _ADEVCFG1_w_LENGTH                       0x00000020

#define _ADEVCFG0_DEBUG_POSITION                 0x00000000
#define _ADEVCFG0_DEBUG_MASK                     0x00000003
#define _ADEVCFG0_DEBUG_LENGTH                   0x00000002

